In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.126565 -0.575910 -0.045672  1.185215
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662 -0.613990
2013-01-04  1.292662  0.211760 -1.655164  0.163078
2013-01-05 -0.087527  0.887876 -0.811624  0.136099
2013-01-06  0.533773 -0.093606  1.725284  0.870862

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.126565 -0.575910 -0.045672  1.185215
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662 -0.613990
2013-01-04  1.292662  0.211760 -1.655164  0.163078
2013-01-05 -0.087527  0.887876 -0.811624  0.136099

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.292662  0.211760 -1.655164  0.163078
2013-01-05 -0.087527  0.887876 -0.811624  0.136099
2013-01-06  0.533773 -0.093606  1.725284  0.870862

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.336861  0.096297  0.546697  0.514227
std    0.513126  0.498949  1.670187  0.749034
min   -0.087527 -0.575910 -1.655164 -0.613990
25%    0.050154 -0.148565 -0.620136  0.142843
50%    0.128786  0.059077  0.624511  0.516970
75%    0.433082  0.288848  1.617636  1.106627
max    1.292662  0.887876  2.772662  1.344097

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.126565    0.024683    0.131007    1.292662   -0.087527    0.533773
B   -0.575910   -0.166884    0.314543    0.211760    0.887876   -0.093606
C   -0.045672    1.294694    2.772662   -1.655164   -0.811624    1.725284
D    1.185215    1.344097   -0.613990    0.163078    0.136099    0.870862

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.185215 -0.045672 -0.575910  0.126565
2013-01-02  1.344097  1.294694 -0.166884  0.024683
2013-01-03 -0.613990  2.772662  0.314543  0.131007
2013-01-04  0.163078 -1.655164  0.211760  1.292662
2013-01-05  0.136099 -0.811624  0.887876 -0.087527
2013-01-06  0.870862  1.725284 -0.093606  0.533773

In [17]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01  0.126565 -0.575910 -0.045672  1.185215
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-06  0.533773 -0.093606  1.725284  0.870862
2013-01-04  1.292662  0.211760 -1.655164  0.163078
2013-01-03  0.131007  0.314543  2.772662 -0.613990
2013-01-05 -0.087527  0.887876 -0.811624  0.136099

In [18]:
df["A"]

2013-01-01    0.126565
2013-01-02    0.024683
2013-01-03    0.131007
2013-01-04    1.292662
2013-01-05   -0.087527
2013-01-06    0.533773
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.126565 -0.575910 -0.045672  1.185215
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662 -0.613990

In [20]:
df.loc[dates[0]]

A    0.126565
B   -0.575910
C   -0.045672
D    1.185215
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.126565 -0.575910
2013-01-02  0.024683 -0.166884
2013-01-03  0.131007  0.314543
2013-01-04  1.292662  0.211760
2013-01-05 -0.087527  0.887876
2013-01-06  0.533773 -0.093606

In [22]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.024683 -0.166884
2013-01-03  0.131007  0.314543
2013-01-04  1.292662  0.211760

In [23]:
df.loc[dates[0], "A"]

0.1265651784118262

In [24]:
df.at[dates[0], "A"]

0.1265651784118262

In [25]:
df.iloc[3]

A    1.292662
B    0.211760
C   -1.655164
D    0.163078
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.292662  0.211760
2013-01-05 -0.087527  0.887876

In [27]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.024683  1.294694
2013-01-03  0.131007  2.772662
2013-01-05 -0.087527 -0.811624

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662 -0.613990

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.575910 -0.045672
2013-01-02 -0.166884  1.294694
2013-01-03  0.314543  2.772662
2013-01-04  0.211760 -1.655164
2013-01-05  0.887876 -0.811624
2013-01-06 -0.093606  1.725284

In [30]:
df.iloc[1, 1]

-0.16688445406283092

In [31]:
df.iat[1, 1]

-0.16688445406283092

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.126565 -0.575910 -0.045672  1.185215
2013-01-02  0.024683 -0.166884  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662 -0.613990
2013-01-04  1.292662  0.211760 -1.655164  0.163078
2013-01-06  0.533773 -0.093606  1.725284  0.870862

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.126565       NaN       NaN  1.185215
2013-01-02  0.024683       NaN  1.294694  1.344097
2013-01-03  0.131007  0.314543  2.772662       NaN
2013-01-04  1.292662  0.211760       NaN  0.163078
2013-01-05       NaN  0.887876       NaN  0.136099
2013-01-06  0.533773       NaN  1.725284  0.870862

In [34]:
df2 = df.copy()

In [35]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [36]:
df2

                   A         B         C         D      E
2013-01-01  0.126565 -0.575910 -0.045672  1.185215    one
2013-01-02  0.024683 -0.166884  1.294694  1.344097    one
2013-01-03  0.131007  0.314543  2.772662 -0.613990    two
2013-01-04  1.292662  0.211760 -1.655164  0.163078  three
2013-01-05 -0.087527  0.887876 -0.811624  0.136099   four
2013-01-06  0.533773 -0.093606  1.725284  0.870862  three

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [38]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df["F"] = s1

In [40]:
df.at[dates[0], "A"] = 0

In [41]:
df.iat[0, 1] = 0

In [42]:
df.loc[:, "D"] = np.array([5] * len(df))

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.045672  5.0  NaN
2013-01-02  0.024683 -0.166884  1.294694  5.0  1.0
2013-01-03  0.131007  0.314543  2.772662  5.0  2.0
2013-01-04  1.292662  0.211760 -1.655164  5.0  3.0
2013-01-05 -0.087527  0.887876 -0.811624  5.0  4.0
2013-01-06  0.533773 -0.093606  1.725284  5.0  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2 > 0] = -df2

In [46]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.045672 -5.0  NaN
2013-01-02 -0.024683 -0.166884 -1.294694 -5.0 -1.0
2013-01-03 -0.131007 -0.314543 -2.772662 -5.0 -2.0
2013-01-04 -1.292662 -0.211760 -1.655164 -5.0 -3.0
2013-01-05 -0.087527 -0.887876 -0.811624 -5.0 -4.0
2013-01-06 -0.533773 -0.093606 -1.725284 -5.0 -5.0

In [47]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [48]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [49]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.045672  5.0  NaN  1.0
2013-01-02  0.024683 -0.166884  1.294694  5.0  1.0  1.0
2013-01-03  0.131007  0.314543  2.772662  5.0  2.0  NaN
2013-01-04  1.292662  0.211760 -1.655164  5.0  3.0  NaN

In [50]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02  0.024683 -0.166884  1.294694  5.0  1.0  1.0

In [51]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.045672  5.0  5.0  1.0
2013-01-02  0.024683 -0.166884  1.294694  5.0  1.0  1.0
2013-01-03  0.131007  0.314543  2.772662  5.0  2.0  5.0
2013-01-04  1.292662  0.211760 -1.655164  5.0  3.0  5.0

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True